[
  {
    "id": "0790d6cc-629e-4560-b1fd-6eee7d967a81",
    "siteName": "LinkedIn",
    "url": "https://www.linkedin.com",
    "accountInfo": "https://www.linkedin.com/in/nickjhuemmer/",
    "responseRate": "OK",
    "description": "This is the primary site to network on and also they have job postings.  They have a system to take in job applications with LinkedIn Easy Apply.  They are also a business-oriented social media site",
    "reviews": "It's good for professional networking, not everyone likes it.",
    "rating": 4,
    "notes": "I've spent a lot of time applying for jobs and trying to network and build posts on this site.   I haven't gotten any serious inquiries off this site yet, though it has been my main place to ",
    "networking": "Yes, this is probably the best site for professional networking",
    "resourcesOffered": "educational videos with premium membership",
    "successRate": "Low",
    "costOrFees": "Annual Premium Membership - $254/year",
    "privacyAndSecurity": "You have to be careful, there seems like there's some funny business that could happen on this site."
  },
  {
    "id": "7efe7178-ba74-4584-976c-c6d0db0f01be",
    "siteName": "Alumni Ventures",
    "url": "https://jobs.av.vc/jobs",
    "accountInfo": "No specific account details",
    "responseRate": "medium",
    "description": "This is a job board linked with the Alumni Ventures venture capital group.  They have a number of different start-ups in different fields.",
    "reviews": "N/a",
    "rating": 3,
    "notes": "This seems like a good place to occassionally check for jobs.  Right now, there doesn't seem to be a lot of fresh software engineering positions listed as of January 2024.",
    "networking": "Yes - seems like there could be some.",
    "resourcesOffered": "Job board",
    "successRate": "Low",
    "costOrFees": "None",
    "privacyAndSecurity": "Seems good"
  },
  {
    "id": "8255fc0d-bed9-4810-b999-0e91e62bfb36",
    "siteName": "Dice",
    "url": "https://www.dice.com/home/home-feed",
    "accountInfo": "https://www.dice.com/dashboard/profiles/active, senior software engineer, full-stack",
    "responseRate": "Low",
    "description": "This site has a lot of jobs posted, but it seems like not everyone has a high rate of success.  It seems \"spammy\" for some reason.",
    "reviews": "OK, not sure it will actually lead to anything.",
    "rating": 3,
    "notes": "Good for putting in applications and LinkedIn often routes to this site with some of their listings.",
    "networking": "Not apparent",
    "resourcesOffered": "resume evaluation, ai tools look for lots of jobs",
    "successRate": "low",
    "costOrFees": "None",
    "privacyAndSecurity": "Seems like it could be low."
  },
  {
    "id": "4f783f42-7a50-4b19-9f88-3b08f1b6f5e6",
    "siteName": "Upwork",
    "url": "https://www.upwork.com/nx/find-work/best-matches",
    "accountInfo": "Experienced Software Engineer and product developer.  ",
    "responseRate": "Very low",
    "description": "You can get short term contract work from this site.  ",
    "reviews": "I haven't read any other reviews or heard of any Codesmith Grads jusing it.",
    "rating": 3,
    "notes": "I'd like to get some work from this site to get more experience.  It seems like there are a lot of people applying on this site and in Fall of 2023 there were very few opportunities.  It seems lately like they've picked-up, so would be worthwhile looking into again.",
    "networking": "It seems possible",
    "resourcesOffered": "They can help you find work, supposedly",
    "successRate": "very low",
    "costOrFees": "Yes - you buy a certain amount of credits to submit proposals for work.",
    "privacyAndSecurity": "It's not clear how good it is."
  }
]
