[
  {
    "id": "550e8400-e29b-41d4-a716-446655440000",
    "date": "2024-01-17",
    "content": "This is one test entry.  We'll keep it to act as a place holder.",
    "tags": [
      "test",
      "entry",
      "journal"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440001",
    "date": "2024-01-15",
    "content": "This is a fake entry to add to the journal page.",
    "tags": [
      "fake",
      "entry",
      "stuff"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440002",
    "date": "2024-01-09",
    "content": "Dummy",
    "tags": [
      "dumb"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440003",
    "date": "2024-01-10",
    "content": "TEst",
    "tags": [
      "test"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440004",
    "date": "2024-01-03",
    "content": "Happy new year",
    "tags": [
      "new year"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440005",
    "date": "2024-01-05",
    "content": "I like turtles.",
    "tags": [
      "turtles",
      "fun"
    ]
  },
  {
    "id": "3b7fba6c-051f-4c96-9daf-eca23fb96eb2",
    "date": "2024-01-17",
    "content": "Another dummy entry, I should include time of day so that entries are more accurately sorted.",
    "tags": [
      "test",
      "sort",
      "stuff"
    ]
  },
  {
    "id": "f6f3991a-4754-4ede-9725-90f985e8fc37",
    "date": "2024-01-17",
    "content": "I started to use some of the new venture capitol sites that I found to place applications.  So far, I placed 6 applications today.  I feel pretty good about it, I also applied to a Y-combinator job posting.   I think that if I get started early enough, that I may be able to get more than five applications in in a day.\n\nI also added this journal feature today.  I'm pretty excited about it as it may help add more motivation to the job search and provide more context for each day's application session.\n\nI'd like to figure out a way to streamline applying for jobs, perhaps by developing some Python scripts to help automate the process.",
    "tags": [
      "journal",
      "applications",
      "data"
    ]
  },
  {
    "id": "6fb4de50-c69a-4622-bc8c-bc7aa0840afa",
    "date": "2024-01-18",
    "content": "I got 10 applications submitted today, a daily record for me!  Almost all of the applications were with Y-combinator and there seems to be a good amount of jobs on that site.  I'll definitely use it again along with the other VC site.  I wonder if I'll have more success with them than LinkedIn and some of the other sites?  \n\nPutting in these applications has been a good way to use and test this application, too.  There was a hiccup with the UUID functionality and finding some of the applications I put in before.\n\n10 applications in a day seems aggressive and I probably was only able to get that many since Y-combinator is fast to apply for.  \n\nI'll have to seek ways to apply for jobs faster so that I can cast a broader net.",
    "tags": [
      "vc",
      "y-combinator",
      "applications",
      "record",
      "daily-record"
    ]
  },
  {
    "id": "de673b97-9e19-417d-b6e6-091cc744217e",
    "date": "2024-01-19",
    "content": "I put in six applications today with an emphasis on VC job boards over LinkedIn and other sites.  I did put one application in via Dice for a job in Herndon, VA.  Originally, I set out to put in 10 applications today, but I had a bit of a hard time finding places to apply that have remote jobs and descriptions for the technologies that I know.\n\nI may go back and place more applications.  I'm not feeling as optimistic about the job search now and I keep thinking that I should be looking into other things to generate revenue.",
    "tags": [
      "venture capitol",
      "search",
      "missed original target",
      "optimism"
    ]
  },
  {
    "id": "b0962fee-a25d-4298-902c-022ac4a7214c",
    "date": "2024-01-22",
    "content": "I was able to put in 10 applications today from across LinkedIn, Alumni Ventures, Y combinator and Lightspeed Partners.  Y-combinator will only let you place 10 applications a week, so that's worth noting, I was only able to put one application for Fathom today.  There were some other applications I didn't feel great about, but much of it's a numbers game and I want to get my numbers up and my resume and information out there.  I was contacted by Scribd recruiter over the weekend, so hopefully that will lead to something.",
    "tags": [
      "Y-combinator",
      "only 10 applications",
      "VC",
      "LinkedIn",
      "Bad Applications",
      "Scribd"
    ]
  },
  {
    "id": "86c78729-2871-42ab-83a7-8f143a505358",
    "date": "2024-01-23",
    "content": "There weren't as many good postings today and I spent a good amount of time trying to figure out how to use an ics file to structure my calendar across my mac, google and proton.  I signed up for two separate job posting sites, CyberCoders and Hackajob.  They seem like a waste of time, but at least I have accounts on there.\n\nI'm not feeling good about the job application process, it seems like a lot of work without a lot of benefit.  But this is always the feeling when applying for jobs online, it's a black hole of work and not a lot of feedback or output.",
    "tags": [
      "cybercoders",
      "hackajob",
      "5 applications",
      "no good listings"
    ]
  },
  {
    "id": "ceff8f68-98a5-4aaa-860d-86fa00a71acf",
    "date": "2024-01-25",
    "content": "It seems like there are much fewer applications available when I screen out the ones that are older than a week or LinkedIn says \"over 100 applicants\".  I haven't really been using LinkedIn lately after seeing a message between Thad and Shahmar that LinkedIn is saturated.  Instead, I'm focusing on Y-combinator, Indeed, VC sites and others.\n\nIt's a bit hard to stay motivated.  The job search is daunting and it seems like no one is hiring or interested in even talking to me.  \n\nI came up with a a plan of action earlier today to address some holes are problems in my resume - basically I need to build out the job application tracker that I've put together so that it's hosted (it's linked to a databased and people can use it).  I probably should go ahead and add it to my resume in place of StyleGPT.  Also, I need to get Goal Keeper up and working so that it looks good on my resume and people can be steered towards it.  \n\nThe other component is focusing on getting the AWS SAA certification done.",
    "tags": [
      "Otta",
      "Y-combinator",
      "AWS",
      "SAA",
      "focus",
      "apps"
    ]
  }
]