[
  {
    "id": "550e8400-e29b-41d4-a716-446655440000",
    "date": "2024-01-17",
    "content": "This is one test entry.  We'll keep it to act as a place holder.",
    "tags": [
      "test",
      "entry",
      "journal"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440001",
    "date": "2024-01-15",
    "content": "This is a fake entry to add to the journal page.",
    "tags": [
      "fake",
      "entry",
      "stuff"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440002",
    "date": "2024-01-09",
    "content": "Dummy",
    "tags": [
      "dumb"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440003",
    "date": "2024-01-10",
    "content": "TEst",
    "tags": [
      "test"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440004",
    "date": "2024-01-03",
    "content": "Happy new year",
    "tags": [
      "new year"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440005",
    "date": "2024-01-05",
    "content": "I like turtles.",
    "tags": [
      "turtles",
      "fun"
    ]
  },
  {
    "id": "3b7fba6c-051f-4c96-9daf-eca23fb96eb2",
    "date": "2024-01-17",
    "content": "Another dummy entry, I should include time of day so that entries are more accurately sorted.",
    "tags": [
      "test",
      "sort",
      "stuff"
    ]
  },
  {
    "id": "f6f3991a-4754-4ede-9725-90f985e8fc37",
    "date": "2024-01-17",
    "content": "I started to use some of the new venture capitol sites that I found to place applications.  So far, I placed 6 applications today.  I feel pretty good about it, I also applied to a Y-combinator job posting.   I think that if I get started early enough, that I may be able to get more than five applications in in a day.\n\nI also added this journal feature today.  I'm pretty excited about it as it may help add more motivation to the job search and provide more context for each day's application session.\n\nI'd like to figure out a way to streamline applying for jobs, perhaps by developing some Python scripts to help automate the process.",
    "tags": [
      "journal",
      "applications",
      "data"
    ]
  },
  {
    "id": "6fb4de50-c69a-4622-bc8c-bc7aa0840afa",
    "date": "2024-01-18",
    "content": "I got 10 applications submitted today, a daily record for me!  Almost all of the applications were with Y-combinator and there seems to be a good amount of jobs on that site.  I'll definitely use it again along with the other VC site.  I wonder if I'll have more success with them than LinkedIn and some of the other sites?  \n\nPutting in these applications has been a good way to use and test this application, too.  There was a hiccup with the UUID functionality and finding some of the applications I put in before.\n\n10 applications in a day seems aggressive and I probably was only able to get that many since Y-combinator is fast to apply for.  \n\nI'll have to seek ways to apply for jobs faster so that I can cast a broader net.",
    "tags": [
      "vc",
      "y-combinator",
      "applications",
      "record",
      "daily-record"
    ]
  },
  {
    "id": "de673b97-9e19-417d-b6e6-091cc744217e",
    "date": "2024-01-19",
    "content": "I put in six applications today with an emphasis on VC job boards over LinkedIn and other sites.  I did put one application in via Dice for a job in Herndon, VA.  Originally, I set out to put in 10 applications today, but I had a bit of a hard time finding places to apply that have remote jobs and descriptions for the technologies that I know.\n\nI may go back and place more applications.  I'm not feeling as optimistic about the job search now and I keep thinking that I should be looking into other things to generate revenue.",
    "tags": [
      "venture capitol",
      "search",
      "missed original target",
      "optimism"
    ]
  },
  {
    "id": "b0962fee-a25d-4298-902c-022ac4a7214c",
    "date": "2024-01-22",
    "content": "I was able to put in 10 applications today from across LinkedIn, Alumni Ventures, Y combinator and Lightspeed Partners.  Y-combinator will only let you place 10 applications a week, so that's worth noting, I was only able to put one application for Fathom today.  There were some other applications I didn't feel great about, but much of it's a numbers game and I want to get my numbers up and my resume and information out there.  I was contacted by Scribd recruiter over the weekend, so hopefully that will lead to something.",
    "tags": [
      "Y-combinator",
      "only 10 applications",
      "VC",
      "LinkedIn",
      "Bad Applications",
      "Scribd"
    ]
  },
  {
    "id": "86c78729-2871-42ab-83a7-8f143a505358",
    "date": "2024-01-23",
    "content": "There weren't as many good postings today and I spent a good amount of time trying to figure out how to use an ics file to structure my calendar across my mac, google and proton.  I signed up for two separate job posting sites, CyberCoders and Hackajob.  They seem like a waste of time, but at least I have accounts on there.\n\nI'm not feeling good about the job application process, it seems like a lot of work without a lot of benefit.  But this is always the feeling when applying for jobs online, it's a black hole of work and not a lot of feedback or output.",
    "tags": [
      "cybercoders",
      "hackajob",
      "5 applications",
      "no good listings"
    ]
  },
  {
    "id": "ceff8f68-98a5-4aaa-860d-86fa00a71acf",
    "date": "2024-01-25",
    "content": "It seems like there are much fewer applications available when I screen out the ones that are older than a week or LinkedIn says \"over 100 applicants\".  I haven't really been using LinkedIn lately after seeing a message between Thad and Shahmar that LinkedIn is saturated.  Instead, I'm focusing on Y-combinator, Indeed, VC sites and others.\n\nIt's a bit hard to stay motivated.  The job search is daunting and it seems like no one is hiring or interested in even talking to me.  \n\nI came up with a a plan of action earlier today to address some holes are problems in my resume - basically I need to build out the job application tracker that I've put together so that it's hosted (it's linked to a databased and people can use it).  I probably should go ahead and add it to my resume in place of StyleGPT.  Also, I need to get Goal Keeper up and working so that it looks good on my resume and people can be steered towards it.  \n\nThe other component is focusing on getting the AWS SAA certification done.",
    "tags": [
      "Otta",
      "Y-combinator",
      "AWS",
      "SAA",
      "focus",
      "apps"
    ]
  },
  {
    "id": "1a520eb5-57da-460c-8e3d-ee158f92c5e2",
    "date": "2024-01-26",
    "content": "I've been struggling with the application process since it's time consuming and seems fruitless.  So I decided today that I'm only going to put in five applications today, and I was able to get it done in less than an hour!  Of course they were applications on Y-combinator and similar sites that take less time.\n\nThis is probably the route that I'm going to take for the near future, spending less time putting in applications and doing more application building, AWS study, and other work.",
    "tags": [
      "Y-combinator",
      "AshbyHQ",
      "fast application",
      "efficiency"
    ]
  },
  {
    "id": "9e90bbf0-f38f-4699-b95c-ce7e95ad8200",
    "date": "2024-01-30",
    "content": "I got five applications in less than an hour.  I've been rushing lately to get some time to study AWS more.  \n\nI feel like I may start to get a little more traction, or at least completing the applications is going a lot faster lately.",
    "tags": [
      "faster",
      "AWS",
      "Otta",
      "feeling better"
    ]
  },
  {
    "id": "dfbc48bf-143e-4181-9ce9-147b50be6581",
    "date": "2024-01-31",
    "content": "I had some trouble getting started today.  I wanted to move my Obsidian vault and it wasn't working right, for some reason it wouldn't download from iCloud.  \n\nAnyway, all applications were placed with Wellfound today. I tried to find anything that was one week old or less and placed an application with them.  All the roles are considered \"Senior\" roles, many of them need 5+ or more experience.  Mainly, I'm just going through the application motions.  \n\nThere was one company called MagicSchool that was compelling, so I placed a future opportunities application with them.",
    "tags": [
      "Magicschool",
      "Wellfound",
      "Getting started",
      "1 hour application time window"
    ]
  },
  {
    "id": "496a6491-a569-4615-9370-d1486620024f",
    "date": "2024-02-01",
    "content": "I feel like I'm just going through the motions, but also feel like I need to put in more applications to get my base number up.  Part of me also thinks I should take some time off and just work on building good applications, like getting Goal Keeper up and running and this Job Application Tracker.  Perhaps I could spend two weeks on each getting them up to where I feel they need to be, then I could add them to an updated version of my resume.\n\nIt's a bit hard to devote too much time to this search if nothing comes up, but that also seems like the lack of opportunities is because of not enough applications being submitted.  But really, the jobs are found through networking, and I'm not sure really how to make that work.  Perhaps it's time to revise the overall plan?",
    "tags": [
      "applications",
      "job hunt",
      "networking",
      "going through the motions",
      "fix current applications",
      "revise plan"
    ]
  },
  {
    "id": "950da616-d1ad-4889-aa33-8f76360a9f84",
    "date": "2024-02-01",
    "content": "The Hallow Coderbyte assessment went well, I used AI tools to help me, but apparently I passed and I'm going onto a phone screen.  This is encouraging, we'll see how the rest goes.  For the next week I think I'll focus on back end stuff to study.",
    "tags": [
      "back end",
      "coderbyte",
      "hallow",
      "study",
      "prepare"
    ]
  },
  {
    "id": "f3de4a97-dbd9-481e-82c8-4d8e9d1cae18",
    "date": "2024-02-02",
    "content": "I met my application goal for the week!  I got a late start today because I spent too much time talking to Samira, but I was able to get six done in an hour.  I'm getting faster at cranking them out and this app surely helps keep track and strategize.\n\nI put in two applications for Ford Motor Company and some other interesting applications.\n\nI'll have to be sure to check for fresh postings on Monday so I can continue to get my numbers in.",
    "tags": [
      "strategy",
      "week complete",
      "applications",
      "good feeling",
      "Ford Motor Company"
    ]
  },
  {
    "id": "8fe38e93-b0d4-4f5b-acec-d3d869ffd73b",
    "date": "2024-02-05",
    "content": "I wanted to get started with some other things this morning, so just placed a bunch of Otta job applications.  I'll come back later this afternoon and add more if I feel up to it and find more.",
    "tags": [
      "rush",
      "Otta",
      "health-care jobs",
      "quick applications"
    ]
  },
  {
    "id": "52a868fb-bcb7-4af1-9295-b274fcf10834",
    "date": "2024-02-06",
    "content": "I did several Y-combinator applications today.  There were some really interesting start-ups that I hope to hear back from.  Bloom and Ophelia are two that stand out.",
    "tags": [
      "interesting",
      "start-ups",
      "Y-combinator",
      "do good"
    ]
  },
  {
    "id": "973bcb7c-9df8-4590-8ae8-6d41ba081382",
    "date": "2024-02-08",
    "content": "I only did three applications this morning since I had the interview and they usually take a lot out of me.  I have some other things I want to do today, so I'll catch up tomorrow.",
    "tags": [
      "Interview",
      "Hallow",
      "Applications",
      "some rejections",
      "come back later."
    ]
  },
  {
    "id": "7246de08-1119-42f6-8a0f-278d55b58a2c",
    "date": "2024-02-12",
    "content": "I got a late start and was a bit distracted, but I did get some applications in.  I'm hopeful that I can set aside a day this week to just put in applications to get my volume up, but I'm also wondering if it makes sense to just pile in the applications as they are posted, so I would have to be ever vigilant and on the look out for them as they come out.\n\nI tried to get some applications in on some other sites besides Otta today, branching out to Lensa, Ziprecruiter and Indeed.\n\nWe'll see where it goes.",
    "tags": [
      "applications",
      "Otta",
      "ziprecruiter",
      "LinkedIn",
      "Lensa"
    ]
  },
  {
    "id": "ad544eda-0629-4ee7-a3b2-47104e29e679",
    "date": "2024-02-15",
    "content": "I got about 7-8 applications in today, and a few rejections.  It's hard to keep after all this and my motivation is waning.  At least tomorrow I'll get to just put in three applications to get 30 for the week.",
    "tags": [
      "low-motivation",
      "tired of applying",
      "rejection"
    ]
  },
  {
    "id": "a5415051-0120-4283-8d18-b23a954fe28a",
    "date": "2024-02-16",
    "content": "It was really hard to get motivated to apply today. There's not a lot of postings out there, a lot of chaff and applications that don't lead anywhere.\n\nAnyway, back at it later.  Maybe it will be time to pivot when 400 applications is reached.",
    "tags": [
      ""
    ]
  },
  {
    "id": "339f778f-3bb8-4dc4-ab92-cb6c88a39766",
    "date": "2024-07-12",
    "content": "Today we start the job search and application process. I had an interview earlier this week and I wasn't really happy with my performance, so I need to practice working on my resume, working through algorithms, organizing my time and SEARCHING FOR WORK.",
    "tags": [
      "jop-search",
      "starting-over",
      "job applications"
    ]
  }
]